Revit 2026 API

# DetailElementOrderUtilsAreDetailElements Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool AreDetailElements(
	Document document,
	View view,
	ICollection<ElementId> detailElementIds
)
```
```vb
Public Shared Function AreDetailElements (
	document As Document,
	view As View,
	detailElementIds As ICollection(Of ElementId)
) As Boolean
```
```cpp
public:
static bool AreDetailElements(
	Document^ document,
	View^ view,
	ICollection<ElementId^>^ detailElementIds
)
```
```fsharp
static member AreDetailElements :
        document : Document *
        view : View *
        detailElementIds : ICollection<ElementId> -> bool
```

#### Parameters

document Document

view View

detailElementIds ICollectionElementId

#### Return Value

Boolean

#### Reference

DetailElementOrderUtils Class

Autodesk.Revit.DB Namespace